{
    "GAME_STATE_START": {
        "desktop": "Click to begin",
        "xr": "Tap to begin",
        "mobile": "Tap to begin"
    },
    "GAME_STATE_BASE": {
        "desktop": "Use W,A,S,D keys to move. Use your mouse to look around. Left-click to interact and right-click to use. Left-click on the clipboard to learn more.",
        "mobile": "Use the right-hand side of the screen to move, and the left-hand side to look around. Tap to interact. Tap on the clipboard to learn more.",
        "xr": "Hold and read the clipboard to get started."
    },
    "GAME_STATE_PICK_SOP": {
        "desktop": "Read the instructions carefully and let go of the clipboard to continue!",
        "mobile": "Read the instructions carefully and let go of the clipboard to continue!",
        "xr": "Read the instructions carefully and let go of the clipboard to continue!"
    },
    "GAME_STATE_PICK_FIREEXTINGUISHER": {
        "desktop": "Aim towards the fire and use the right-click to dispense the foam.",
        "mobile": "Aim towards the fire and use the right-click to dispense the foam.",
        "xr": "Aim towards the fire and press the trigger to dispense the foam."
    },
    "GAME_STATE_PICK_CYLINDER": {
        "desktop": "Right-click near any other cylinder to mix.",
        "mobile": "Right-click near any other cylinder to mix.",
        "xr": "Trigger near any other cylinder to mix."        
    },
    "GAME_STATE_PASS": {
        "desktop": "You mixed the correct set of cylinders! Read the SOP or continue mixing further to continue.",
        "mobile": "You mixed the correct set of cylinders! Read the SOP or continue mixing further to continue.",
        "xr": "You mixed the correct set of cylinders! Read the SOP or continue mixing further to continue."
    },
    "GAME_STATE_FAIL": {
        "desktop": "You caused a fire! Open the extinguisher cabinet, pick the extinguisher (LMB), aim towards the exit door and dispense foam (RMB).",
        "mobile": "You caused a fire! Open the cabinet and extinguish the fire using the action button while aiming towards the exit door.",
        "xr": "You caused a fire! Use the grip button to open the cabinet and pick the extinguisher, aim towards the exit door and then use the trigger to dispense the foam."        
    },
    "GAME_STATE_SOP_PASS": {
        "desktop": "You have completed the SOP!",
        "mobile": "You have completed the SOP!",
        "xr": "You have completed the SOP!"
    },
    "GAME_STATE_PICK": {
        "desktop": "Left click to pick!",
        "mobile": "Tap on the grab button to pick!",
        "xr": "Squeeze to pick!"
    },
    "GAME_STATE_AFTER_SOP": {
        "desktop": "Mix the cylinders as mentioned in the SOP! Use your left mouse button to interact with them.",
        "mobile":  "Mix the cylinders as mentioned in the SOP!",
        "xr":  "Mix the cylinders as mentioned in the SOP! Use your grip to interact with them."
    }
}